Repository: tarlanpay/tarlan-woocommerce
Catalog: tarlan-payments-gateway/languages/tarlan-payments-gateway-*.po
Languages: ru_ru

source: Merchant ID
ru_ru: Идентификатор мерчанта

source: This ID is your merchant ID in the Tarlan Payments system
ru_ru: Этот идентификатор является вашим идентификатором продавца в платежной системе Tarlan

source: Project ID
ru_ru: Идентификатор проекта

source: This ID is your project ID in the Tarlan Payments system
ru_ru: Этот идентификатор является идентификатором вашего проекта в платежной системе Tarlan

source: Secret Key
ru_ru: Секретный ключ

source: You can get this key during onboarding in Tarlan Payments
ru_ru: Вы можете получить этот ключ во время регистрации в системе Tarlan Payments

source: Success Redirect Type
ru_ru: Тип успешного перенаправления

source: Choose where to redirect users upon successful payment.
ru_ru: Выберите, куда перенаправлять пользователей после успешной оплаты.

source: Order Received Page
ru_ru: Страница получения заказа

source: Custom URL
ru_ru: Пользовательский URL-адрес

source: Custom Success Redirect URL
ru_ru: Настраиваемый URL-адрес успешного перенаправления

source: Enter the URL to redirect users upon successful payment if 'Custom URL' is selected.
ru_ru: Введите URL-адрес для перенаправления пользователей после успешной оплаты, если выбран "Пользовательский URL".

source: Failure redirect URL
ru_ru: URL-адреса на перенаправление после неуспешной оплаты

source: The user will be automatically redirected to this Internet address if the payment is unsuccessful
ru_ru: В случае неудачной оплаты пользователь будет автоматически перенаправлен на этот интернет-адрес

source: Test merchant ID
ru_ru: Идентификатор мерчанта в тестовой среде

source: Test project ID
ru_ru: Идентификатор проекта в тестовой среде

source: Test secret Key
ru_ru: Секретный ключ в тестовой среде

source: Test mode
ru_ru: Тестовый режим

source: On/Off
ru_ru: Вкл/Выкл

source: In this mode, you can test the capabilities of the Tarlan Payments payment gateway
ru_ru: В этом режиме вы можете протестировать возможности платежного шлюза Tarlan Payments

source: Status Mapping
ru_ru: Маппер статусов

source: Map Tarlan Payments status codes to WooCommerce order statuses
ru_ru: Сопоставьте коды статуса платежей Tarlan со статусами заказов в WooCommerce

source: Success status
ru_ru: Статус "success"

source: Select the WooCommerce order status when the Tarlan Payments status is 'success'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "success".

source: Holded status
ru_ru: Статус "holded"

source: Select the WooCommerce order status when the Tarlan Payments status is 'holded'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "holded".

source: Processed status
ru_ru: Статус "processed"

source: Select the WooCommerce order status when the Tarlan Payments status is 'processed'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "processed".

source: Refund status
ru_ru: Статус "refund"

source: Select the WooCommerce order status when the Tarlan Payments status is 'refund'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "refund".

source: Failed status
ru_ru: Статус "failed"

source: Select the WooCommerce order status when the Tarlan Payments status is 'failed'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "failed".

source: Canceled status
ru_ru: Статус "canceled"

source: Select the WooCommerce order status when the Tarlan Payments status is 'canceled'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "canceled".

source: Pending status
ru_ru: Статус "pending"

source: Select the WooCommerce order status when the Tarlan Payments status is 'pending'.
ru_ru: Выберите статус заказа в WooCommerce, если статус платежей Tarlan равен "pending".
